In [8]:
from mysql.connector import connect
import pandas as pd

In [14]:
try: 
    conn = connect(host='localhost', user='root', password='root', database='TestDB', port='8889')
    # conn = connect(host='172.24.40.247', user='hv', password='123456', database='olympics', port='3306')
    print('Connected to database!')
except:
    print('Unable to connect.')

Connected to database.

In [15]:
cur = conn.cursor()

In [16]:
# sql = 'select * from medals where year=2012 and medal="gold" limit 5'
sql = '''
select * 
from medals
where year=2012 and medal="gold"
limit 5
'''

In [17]:
df = pd.read_sql(sql, conn)
df

,Id,Year,City,Sport,Discipline,Athlete,CountryCode,Gender,Event,Medal
0,29217,2012,London,Aquatics,Diving,"BOUDIA, David",USA,Men,10M Platform,Gold
1,29220,2012,London,Aquatics,Diving,"CHEN, Ruolin",CHN,Women,10M Platform,Gold
2,29223,2012,London,Aquatics,Diving,"ZAKHAROV, Ilya",RUS,Men,3M Springboard,Gold
3,29226,2012,London,Aquatics,Diving,"WU, Minxia",CHN,Women,3M Springboard,Gold
4,29229,2012,London,Aquatics,Diving,"CAO, Yuan",CHN,Men,Synchronized 10M,Gold

In [5]:
cur.execute(sql)

In [6]:
for row in cur:
    print(row)

(29217, 2012, 'London', 'Aquatics', 'Diving', 'BOUDIA, David', 'USA', 'Men', '10M Platform', 'Gold')
(29220, 2012, 'London', 'Aquatics', 'Diving', 'CHEN, Ruolin', 'CHN', 'Women', '10M Platform', 'Gold')
(29223, 2012, 'London', 'Aquatics', 'Diving', 'ZAKHAROV, Ilya', 'RUS', 'Men', '3M Springboard', 'Gold')
(29226, 2012, 'London', 'Aquatics', 'Diving', 'WU, Minxia', 'CHN', 'Women', '3M Springboard', 'Gold')
(29229, 2012, 'London', 'Aquatics', 'Diving', 'CAO, Yuan', 'CHN', 'Men', 'Synchronized 10M', 'Gold')

In [13]:
cur.close()
conn.close()